<?php

echo 60 * 60;

$a = 3;
echo $a + 6;


echo 60 * 60 * 24;

$var = 1;
$var += 12;
$var = $var - 14;
$var = $var * 5;
$var = $var / 7;
$var = $var + 1;
$var = $var - 1;
echo $var;


$a = 3;
echo $a;

$a = 10;
$b = 2;
echo $a + $b;
echo $a - $b;
echo $a * $b;
echo $a / $b;


$c = 15;
$d = 2;
$result = $c + $d;
echo $result;
?>

<?php
$a = 10;
$b = 2;
$c = 5;
echo $a + $b + $c;
?>

<?php
$a = 17;
$b = 10;
$c = $a - $b;
$d = 7;
$result = $c + $d;
echo $result;
?>

<?php
$text = 'Привет, мир!';
echo $text;
?>

<?php
$text1 = 'Привет,';
$text2 = 'Мир!';
echo $text1 . $text2;
?>

<?php
$name = 'Viktor!';

echo 'Привет,' . $name;
?>

<?php
$age = 40;
echo 'Мне' . $age . ' лет!';
?>

<?php
$text = 'abcde';
echo $text[0];
echo $text[2];
echo $text[4];
?>

<?php
$a = 'abcde';
$a[0] = '!';
echo $a;
?>

<?php

$num = '12345';
$a = $num[0];
$b = $num[1];
$c = $num[2];
$d = $num[3];
$e = $num[4];
echo $a + $b + $c + $d + $e;
?>


<?php
echo 60 * 60; //sek v hours
echo 60 * 60 * 24; // sek v sutkax
echo 60 * 60 * 24 * 30; // v mecyats
?>

<?php
$hours = date("H");
$minutes = date("m");
$seconds = date('s');
echo $hours . ':' . $minutes . ':' . $seconds;
?>

<?php
$a = 5;
echo $a * $a;
?>

<?php
$var = 47;
$var += +7;
$var -= 18;
$var *= 10;
$var /= 20;
echo $var;
?>

<?php
$text = 'Я';
$text .= 'хочу';
$text .= 'знать';
$text .= 'PHP';
echo $text;
?>

<?php
$var = 10;
$var++;
$var++;
$var--;
echo $var;
?>

<?php
$var = 10;
$var += 7;
$var++;
$var--;
$var += 12;
$var *= 7;
$var -= 15;
echo $var;
?>


<?php
$arr = ['Привет,', 'мир', '!'];
echo $arr[0] . $arr[1] . $arr[2];
?>

<?php
$arr = ['Привет,', 'мир', '!'];
$text = $arr[0] . $arr[1] . $arr[2];
echo $text;
?>

<?php
$arr = ['Привет,', 'мир', '!'];
$arr[0] = 'Пока,';
var_dump($arr);
?>


<?php
$arr = ['Коля' => '1000$', 'Вася' => '5000', 'Петя' => '200$'];
echo $arr['Коля'];
?>

<?php
$arr = [
    'ru' => ['голубой', 'красный', 'зеленый'],
    'en' => ['blue', 'red', 'green'],
];
var_dump($arr['ru']);
echo $arr['ru'][0];
echo $arr['ru'][1];
echo $arr['en'][1];
?>

<?php
$arr = ['a', 'b', 'c'];
var_dump($arr);
?>

<?php
$arr = ['a', 'b', 'c'];
echo $arr[0] . $arr[1] . $arr[2];
?>

<?php
$arr = ['a', 'b', 'c', 'd'];
echo $arr[0] . '+' . $arr[1] . ',' . $arr[2] . '+' . $arr[3];
?>


<?php
$arr = ['html', 'css', 'php', 'js', 'jq'];
foreach ($arr as $elem) {
    echo $elem . '<br>';
}
?>


<?php

$arr = [10, 20, 15, 17, 24, 35];
$result = 0;
foreach ($arr as $elem) {
    $result = $result + $elem;
}
echo $result;
?>

<?php

$i = 1;
while ($i <= 100) {
    echo $i . '<br>';
    $i++;


}
?>


<?php
for ($i = 1; $i <= 100; $i++) {
    echo $i . '<br>';
}
?>

<?php
$arr = [1, 2, 3, 4, 5];
$result = 0;
foreach ($arr as $elem) {
    $result += $elem * $elem;


}
echo $result;

?>

<?php
$arr = ['green' => 'зеленый', 'red' => 'красный', 'blue' => 'голубой'];
foreach ($arr as $key => $elem) {
    echo $key . '-' . $elem . '<br>';
}
?>

<?php
$arr = ['Коля' => '200', 'Вася' => '300', 'Петя' => '400'];
foreach ($arr as $key => $elem) {
    echo '\'' . $key . '-' . 'зарплата' . $elem . 'долларов\'' . '<br>';
}
?>

<?php
$i = 0;
while ($i <= 100) {
    if ($i > 0) {
        $k = $i % 2;
        if ($k === 0) {
            echo $i . '<br>';
        }

    }
    $i++;
}
?>

<?php
$sum = 0;
$i = 1;
while ($i <= 100) {
    $sum += $i;
    $i++;
}
echo $sum;


?>

<?php
for ($i = 11; $i <= 33; $i++) {
    echo $i . '<br>';
}
?>

<?php
for ($i = 0; $i <= 100; $i++) {
    if ($i > 0 && $i % 2 == 0) {
        echo $i . '<br>';
    }
}
?>

<?php
$sum = 0;
for ($i = 1; $i <= 100; $i++) {
    $sum += $i;
}
echo $sum;
?>

<?php
$arr = [2, 5, 9, 15, 0, 4];
foreach ($arr as $elem) {
    if ($elem >= 3 and $elem <= 10)

        echo $elem . '<br>';
}
?>
<?php
$arr = [1, 5, -3, -8, 9, -15, 10, 15, 22, -99];
$result = 0;
foreach ($arr as $elem) {
    if ($elem >= 0) {
        $result = $result + $elem;
    }
}

echo $result;
?>

<?php
$arr = [1, 2, 5, 9, 4, 13, 4, 10];
foreach ($arr as $elem) {
    if ($elem === 4) {
        echo 'Есть!';
        break;
    }
}
?>

<?php
$arr = ['10', '20', '30', '50', '235', '3000'];
foreach ($arr as $elem) {
    if ($elem[0] == 1 or $elem[0] == 2 or $elem[0] == 5) {
        echo $elem;
    }


}
?>

<?php
$arr = ['10', '20', '30', '50', '235', '3000'];
foreach ($arr as $elem) {

    if (in_array($elem[0], [1, 2, 5])) {
        echo $elem . '<br>';
    }

}
?>


<?php
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
$str = '';
foreach ($arr as $elem) {
    $str .= $elem;

}
echo $str;

?>


<?php
$arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
foreach ($arr as $key => $elem) {
    if ($key == 5 or $key == 6) {
        echo '<strong>' . $elem . '</strong>';
    } else {
        echo $elem;
    }

}
?>

<?php
$arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
$day = 3;
foreach ($arr as $key => $elem) {
    if ($key == $day) {
        echo '<em>' . $elem . '</em>';
    } else {
        echo $elem;
    }

}
?>

<?php
$arr = []; //с помощью цикла фор заполнить массов от 1 до 100
for ($a = 1; $a <= 100; $a++) {
    $arr[] = $a;

}
var_dump($arr);

?>

<?php //дан массив ар, с помощью форича записать анг назв в массив ен а рус в ру
$arr = ['green' => 'зеленый', 'red' => 'красный', 'blue' => 'голобой'];
$en = []; //анг названия
$ru = []; //руские названия
foreach ($arr as $key => $elem) {
    $en[] = $key;
    $ru [] = $elem;

}
var_dump($en, $ru);
?>

<?php
// Функция вернет рандомное число от -10 до +10;
$x = rand(-10, 10);

var_dump($x);
if ($x > 0) {
    $x = sin($x);
    $y = pow($x, 2);
} else {
    // pow возводит число в квадрат
    $x = pow($x, 2);
    $y = 1 - 2 * sin($x);
}

echo $y;
?>

<?php
//Определить, в какую из областей — I или II (рис. 4.1) — попадает точка с за-
//данными координатами. Для простоты принять, что точка не попадает на гра-
//ницу областей.
$x = rand(-10, 10);

if ($x < 4) {
    echo 'I';
} else {
    echo 'II';
}

echo '<br>' . $x;
?>

<?php

//Фирме принадлежат два магазина. Известна стоимость товаров, проданных
//в каждом магазине за каждый день в июле и августе, которая хранится
//в двух массивах. Получить общую стоимость проданных фирмой товаров за
//два месяца.

$arr = [
    'august' => [],
    'jule' => []
];

for ($i = 1; $i <= 31; $i++) {
    $arr['august'][] = rand(100, 10000);
    $arr['jule'][] = rand(100, 10000);
}

echo 'За июль - ' . array_sum($arr['jule']) . '<br>';
echo 'За Август - ' . array_sum($arr['august']) . '<br>';
var_dump('<pre>', $arr);
echo array_sum($arr['jule']) + array_sum($arr['august'])


?>
<?php
//В области 20 районов. Площади, засеянные пшеницей (в гектарах), и урожай, собранный в каждом районе (в центнерах),
//  хранятся в двух массивах.
//Определить среднюю урожайность пшеницы по каждому району и по области в целом.
//Задачу решить двумя способами:
//1) без использования дополнительного (третьего) массива;
//2) с использованием дополнительного массива.

$districts = [
    1 => [
        'square' => [10, 15, 20, 25, 30],
        'harvest' => [1000, 1500, 2500, 3000]
    ],
    2 => [
        'square' => [8, 11, 14, 17, 20],
        'harvest' => [800, 1100, 1400, 1700, 2000]
    ],
    3 => [
        'square' => [1, 3, 5, 7, 9],
        'harvest' => [100, 300, 500, 700, 900]],
    4 => [
        'square' => [2, 4, 6, 8, 10],
        'harvest' => [200, 400, 600, 800, 1000]
    ],
    5 => [
        'square' => [3, 6, 9, 12, 15],
        'harvest' => [300, 600, 900, 1200, 1500]
    ],
    6 => [
        'square' => [4, 7, 10, 13, 16],
        'harvest' => [400, 700, 1000, 1300, 1600]],
    7 => [
        'square' => [2, 5, 6, 8, 3],
        'harvest' => [200, 500, 600, 800, 300],
    ],
    8 => [
        'square' => [1, 5, 7, 6, 2],
        'harvest' => [100, 500, 700, 600, 200]
    ],
    9 => [
        'square' => [2, 3, 5, 6, 7],
        'harvest' => [200, 300, 500, 600, 700],
    ],
    10 => [
        'square' => [11, 6, 7, 2, 10],
        'harvest' => [1100, 600, 700, 200, 1000]
    ],
    11 => [
        'square' => [1, 3, 6, 8, 9],
        'harvest' => [100, 300, 600, 800, 900]
    ],
    12 => [
        'square' => [9, 8, 7, 6, 5],
        'harvest' => [900, 800, 700, 600, 500]
    ],
    13 => ['square' => [1, 5, 9, 3, 5],
        'harvest' => [100, 500, 900, 300, 500]
    ],
    14 => [
        'square' => [2, 5, 8, 6, 3],
        'harvest' => [200, 500, 800, 600, 300]
    ],
    15 => [
        'square' => [1, 4, 7, 2, 6],
        'harvest' => [100, 400, 700, 200, 600]
    ],
    16 => ['square' => [3, 6, 9, 8, 7],
        'harvest' => [300, 600, 900, 800, 700]
    ],
    17 => ['square' => [8, 7, 9, 6, 3],
        'harvest' => [800, 700, 900, 600, 300]
    ],
    18 => ['square' => [4, 5, 6, 1, 2],
        'harvest' => [400, 500, 600, 100, 200]
    ],
    19 => [
        'square' => [3, 2, 1, 4, 5],
        'harvest' => [300, 200, 100, 400, 500]
    ],
    20 => [
        'square' => [5, 2, 3, 1, 4],
        'harvest' => [500, 200, 300, 100, 400],
    ]

];


foreach ($districts as $item => $value){
    var_dump('<pre>', $value);
}

var_dump('<pre>', $districts);


?>

<?php

////В области 20 районов. Площади, засеянные пшеницей (в гектарах), и урожай, собранный в каждом районе (в центнерах),
////  хранятся в двух массивах.
////Определить среднюю урожайность пшеницы по каждому району и по области в целом.
////Задачу решить двумя способами:
////1) без использования дополнительного (третьего) массива;
////2) с использованием дополнительного массива.
//
//
//$arr = [];
//
//for ($i = 1; $i <= 20; $i++) {
//    $arr[$i] = [
//
//    ];
//}
//
//$districts = [
//    1 => [
//        'square' => [10, 15, 20, 25, 30],
//        'harvest' => [1000, 1500, 2500, 3000],
//    ],
//    2 => [
//        'square' => [8, 11, 14, 17, 20],
//        'harvest' => [800, 1100, 1400, 1700, 2000]
//    ],
//    3 => [
//        'square' => [1, 3, 5, 7, 9],
//        'harvest' => [100, 300, 500, 700, 900]],
//    4 => [
//        'square' => [2, 4, 6, 8, 10],
//        'harvest' => [200, 400, 600, 800, 1000]
//    ],
//    5 => [
//        'square' => [3, 6, 9, 12, 15],
//        'harvest' => [300, 600, 900, 1200, 1500]
//    ],
//    6 => [
//        'square' => [4, 7, 10, 13, 16],
//        'harvest' => [400, 700, 1000, 1300, 1600]],
//    7 => [
//        'square' => [2, 5, 6, 8, 3],
//        'harvest' => [200, 500, 600, 800, 300],
//    ],
//    8 => [
//        'square' => [1, 5, 7, 6, 2],
//        'harvest' => [100, 500, 700, 600, 200]
//    ],
//    9 => [
//        'square' => [2, 3, 5, 6, 7],
//        'harvest' => [200, 300, 500, 600, 700],
//    ],
//    10 => [
//        'square' => [11, 6, 7, 2, 10],
//        'harvest' => [1100, 600, 700, 200, 1000]
//    ],
//    11 => [
//        'square' => [1, 3, 6, 8, 9],
//        'harvest' => [100, 300, 600, 800, 900]
//    ],
//    12 => [
//        'square' => [9, 8, 7, 6, 5],
//        'harvest' => [900, 800, 700, 600, 500]
//    ],
//    13 => ['square' => [1, 5, 9, 3, 5],
//        'harvest' => [100, 500, 900, 300, 500]
//    ],
//    14 => [
//        'square' => [2, 5, 8, 6, 3],
//        'harvest' => [200, 500, 800, 600, 300]
//    ],
//    15 => [
//        'square' => [1, 4, 7, 2, 6],
//        'harvest' => [100, 400, 700, 200, 600]
//    ],
//    16 => ['square' => [3, 6, 9, 8, 7],
//        'harvest' => [300, 600, 900, 800, 700]
//    ],
//    17 => ['square' => [8, 7, 9, 6, 3],
//        'harvest' => [800, 700, 900, 600, 300]
//    ],
//    18 => ['square' => [4, 5, 6, 1, 2],
//        'harvest' => [400, 500, 600, 100, 200]
//    ],
//    19 => [
//        'square' => [3, 2, 1, 4, 5],
//        'harvest' => [300, 200, 100, 400, 500]
//    ],
//    20 => [
//        'square' => [5, 2, 3, 1, 4],
//        'harvest' => [500, 200, 300, 100, 400],
//    ]
//
//];
//
//$totalSq = 0;
//$totalH = 0;
//
//foreach ($districts as $key => $item) {
//
//
//    $sum_square = array_sum($item['square']);
//    $sum_harvest = array_sum($item['harvest']);
//
//    // без 3-го
//    $totalSq += $sum_square;
//    $totalH += $sum_harvest;
//    echo 'Средний урожай по району ' . $key . ' - ' . $sum_harvest / $sum_square . '<br>';
//
////    $districts[$key]['total']['avc_square'] = $sum_harvest / $sum_square;
////    $districts[$key]['total']['sum_square'] = $sum_square;
////    $districts[$key]['total']['sum_harvest'] = $sum_harvest;
//}
//
//echo '<hr>Средний урожай по области ' . $totalSq / $totalH . '<br>';
//
//
////
////$totalSq = 0;
////$totalH = 0;
////
////foreach ($districts as $key => $district){
////    $totalSq += $district['total']['sum_square'];
////    $totalH += $district['total']['sum_harvest'];
////
////    echo 'Средний урожай по району ' . $key . ' - ' . $district['total']['avc_square'] . '<br>';
////}
////
////echo 'Средний урожай по области ' . $totalSq/$totalH . '<br>';
//
//?>
<?php
////Размеры 12 параллелепипедов (длина, ширина, высота) хранятся в трех
////массивах. Вывести на экран объемы каждой фигуры.
////Задачу решить двумя способами:
////1) без использования дополнительного (третьего) массива;
////2) с использованием дополнительного массива.
//$cube = [
//    1 => [
//        'length' => [1, 2, 3, 4, 5],
//        'width' => [1, 2, 3, 4, 5],
//        'height' => [1, 2, 3, 4, 5]
//    ],
//    2 => [
//        'length' => [1, 2, 3, 4, 5],
//        'width' => [1, 2, 3, 4, 5],
//        'height' => [1, 2, 3, 4, 5]
//    ],
//    3 => [
//        'length' => [1, 2, 3, 4, 5],
//        'width' => [1, 2, 3, 4, 5],
//        'height' => [1, 2, 3, 4, 5],
//    ],
//    4 => [
//        'length' => [1, 2, 3, 4, 5],
//        'width' => [1, 2, 3, 4, 5],
//        'height' => [1, 2, 3, 4, 5]
//    ],
//    5 => [
//        'length' => [1, 2, 3, 4, 5],
//        'width' => [1, 2, 3, 4, 5],
//        'height' => [1, 2, 3, 4, 5]
//    ],
//
//
//];
//$totallength = 0;
//
//$totalwidth = 0;
//$totalheight = 0;
//
//
//foreach ($cube as $key => $item) {
//
//
//    $sum_length = array_sum($item['length']);
//    $sum_width = array_sum($item['width']);
//    $sum_height = array_sum($item['height']);
//
//    // без 3-го'
//    $cube[$key]['total']['avc_length'];
////    $districts[$key]['total']['sum_square'] = $sum_square;
////    $districts[$key]['total']['sum_harvest'] = $sum_harvest;
////  $totallength += $sum_length;
//    // $totalH += $sum_harvest;
//    //echo $item ['length'][] *$item ['width'][] * $item['height'][] . '<br>';
//    //var_dump($cube);
//}
//?>
    <!---->
    <!--    //Известны данные о мощности двигателя (в лошадиных силах — л. с.)-->
    <!--    //и стоимости 30-ти марок легковых автомобилей. Напечатать стоимость каждого из автомобилей,-->
    <!--    //у которых мощность двигателя не превышает 80 л. с.-->
    <!--    //-->
<?php
//$cars = [
//    ['power' => 50, 'price' => 100000],
//    ['power' => 70, 'price' => 120000],
//    ['power' => 150, 'price' => 150000],
//    ['power' => 80, 'price' => 130000],
//    ['power' => 250, 'price' => 200000],
//    ['power' => 90, 'price' => 110000],
//    ['power' => 60, 'price' => 105000],
//    ['power' => 150, 'price' => 150000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//    ['power' => 50, 'price' => 100000],
//];
//foreach ($cars as $car) {
//    if ($car['power'] <= 80) {
//        echo $car['price'] . '<br>';
//        // var_dump('<pre>', $car);
//    }
//}
//
//?>
<?php
////В одном массиве записано количество мячей, заброшенных баскетбольной
////командой в каждом из 15-ти матчей, в другом — количество пропущенных
////мячей. Для каждой игры определить словесный результат игры (выигрыш
////или проигрыш).
//
//
//$hammered = [89, 115, 78, 121, 96, 85, 75, 98, 105, 111, 56, 121, 115, 93, 102];
//$missed = [75, 88, 95, 79, 36, 52, 98, 96, 58, 63, 79, 65, 84, 107, 88];
//
//foreach ($hammered as $key => $item) {
//    $result = $item - $missed[$key];
//    if ($result > 0) {
//        echo 'выиграш';
//    } elseif ($result == 0) {
//        echo 'проигрыш';
//    } else {
//        echo 'проигрыш';
//    }
//}
//
//
////var_dump('<pre>', );
//
//
//?>
<?php
////Известны данные о численности населения (в миллионах жителей)
////и площади (в миллионах квадратных километров) 28 государств.
////Определить общую численность  государств, чья площадь превышает 5 млн кв. км.
//
//$states = [
//    1 => [
//        'populetion' => [1, 1.5, 2, 0.7, 0.5],
//        'area' => [4, 6, 8, 3, 2]
//    ],
//    2 => [
//        'populetion' => [2],
//        'area' => [8]
//    ],
//    3 => [
//        'populetion' => [1],
//        'araa' => [2]
//    ],
//    4 => [
//        'populetion' => [4],
//        'area' => [9]
//    ],
//    5 => [
//        'populetion' => [3],
//        'area' => [8]
//    ],
//    6 => [
//        'populetion' => [2],
//        'area' => [6]
//    ],
//    7 => [
//        'populetion' => [1],
//        'area' => [4]
//    ],
//    8 => [
//        'populetion' => [6],
//        'area' => [10]
//    ],
//    9 => [
//        'populetion' => [5],
//        'area' => [11]
//    ],
//    10 => [
//        'populetion' => [2],
//        'area' => [7],
//    ]
//
//
//];
////$arr = [];
////
////for ($i = 0; $i < 28; $i++){
////    $arr[] = ['aria' => rand(1, 100), 'population' => rand(10, 1000)];
////}
//
//
////11.227. Имеется информация о количестве осадков, выпавших за каждый день месяца,
//// и о температуре воздуха в эти дни.
//// Определить, какое количество
////осадков выпало в виде снега и какое — в виде дождя. (Считать, что идет
////дождь, если температура воздуха выше 0 С.)
//
//$arr = [
//    'temperature' => [],
//    'precipitation' => []
//];
//for ($i = 1; $i <= 31; $i++) {
//    $arr[$i] = ['temperature' => rand(-25, 40), 'precipitation' => rand(10, 100)];
//    // $arr['temperature'][] = rand(-25, 40);
//    // $arr['precipitation'][] = rand(10, 100);
//}
//$snow = 0;
//$rain = 0;
//foreach ($arr as $i => $item) {
//    if ($item['temperature'] > 0) {
//        $rain += $item['precipitation'];
//    } else {
//        $snow += $item['precipitation'];
//    }
//}
//echo 'дождь-' . $rain . 'мм', 'снег-' . $snow . 'мм';
//?>
<?php
////11.229. Имеется информация о количестве осадков, выпавших за каждый день января
//// и за каждый день марта. Определить, в каком из этих месяцев выпало
////больше осадков
//$arr = [
//    'january' => [],
//    'marsh' => []
//];
//for ($i = 1; $i <= 31; $i++) {
//    // $arr[$i]=[ 'january' =>  rand(1,100), 'marsh' => rand (1,100) ];
//    $arr['january'][$i] = rand(1, 100);
//    $arr['marsh'][$i] = rand(1, 100);
//}
//$january = 0;
//$marsh = 0;
//foreach ($arr as $i => $item) {
//    $january += $item['january'];
//    $marsh += $item['marsh'];
//}
//if ($january > $marsh) echo 'больше в январе'; else echo 'больше в марте';
//?>
<?php
////11.230. Фирма имеет два магазина. Известен доход каждого магазина за каждый день
////февраля. Определить, в каком из магазинов общий доход за месяц меньше.
//
//$arr = [' shop_1' => [], 'shop_2' => []];
//for ($i = 1; $i <= 28; $i++) {
//    $arr['shop_1'][$i] = rand(1, 100);
//    $arr['shop_2'][$i] = rand(1, 100);
//}
//
//$shop_1 = array_sum($arr['shop_1']);
//$shop_2 = array_sum($arr['shop_2']);
//
//
//if ($shop_1 < $shop_2)
//    echo 'больше в маг1';
//else
//    echo 'больше в маг_2';
//?>
    <!---->
    <!---->
<?php
////11.231. Известны данные о массе (в кг) и объеме (в см3
////) 20-ти предметов, изготов ленных из различных материалов. Определить максимальную плотность
////материала
//$arr = [
//    'density' => []
//];
//$arr = ['weight' => [], 'volume' => []];
//for ($i = 1; $i <= 20; $i++) {
//    $arr['weight'][$i] = rand(1, 100);
//    $arr['volume'][$i] = rand(1, 130);
//    $arr['density'][$i] = $arr['weight'][$i] / $arr['volume'][$i];
//}
////foreach ()
//echo max([$arr['density'][$i]]) . 'м^3';
//
//?>
<?php
//11.232. Известны длины участков пути (в км), которые проехали 25 легковых автомобилей,
// и время, затраченное каждым из них (в часах). Определить минимальную из средних скоростей
// движения автомобилей на участках.
//Задачу решить двумя способами:
//1) без использования дополнительного (третьего) массива;
//2) с использованием дополнительного массива.
//$arr=[
//  'length'=>[], 'time'=>[], 'speed'=>[]
////for ($i=1; $i<=25; $i++) {
//  $arr['length'][$i] = rand(10,100);
//  $arr['time'][$i] = rand(1,2);
// $arr['speed'][$i] = $arr['length'][$i]/$arr['time'][$i];

//}
//echo min ( $arr['speed']).'км/ч';
//var_dump('<pre>', $arr);

//?>
    //<?php
//$arr = [];
//$arr = ['length'=>[], 'time'=>[]];
//for ($i = 1; $i <= 25; $i++) {
//  $arr[$i] = [
//  'length' => rand(10, 100),
//  'time' => rand(1, 2)
//];
//}
//$avc = 0;

//foreach ($arr as  $item) {
// $val = $item['length'] / $item['time'];
// if ($avc === 0 or $avc < $val) {
//     $avc = $val;
//  }
//  }
// echo $avc. 'км/ч';
//var_dump($value); die();

//  if($avc > 0 && $avc <= $avc ) echo $avc;

?>
<?php
//11.235. Дан массив. Скопировать все его элементы в другой массив такого же размера:
//а) в том же порядке расположения элементов;
//б) в обратном порядке расположения элементов.
//$arr = [1,2,3,4,5];
//$arr1=[5];

//foreach ($arr as $item) {
//  $arr1[] = $item[$arr];
//
//var_dump('<pre>', $arr);
//echo $arr1;

$arr = [1,2,3,4,5];
$arr1=[];
for ($i=4; $i>=0; $i--) {
    $arr1[] = $arr[$i];
}

var_dump('<pre>', $arr1);
?>

<?php
//11.236. Из элементов массива a сформировать массив b
// того же размера по правилу: если номер i элемента массива a четный,


//11.236. Из элементов массива a сформировать массивa b того же размера
// по правилу: если номер i элемента массива a  четный то bi=ai^2,
//в противном случае    bi=2ai


$arr = [1, 2, 3, 4, 5];
$arr1 = [];

foreach ($arr as $item) {
    $arr1[] = $item;


    if ($item % 2 === 0) {
        echo $arr1[] = $item * $item;
    } else {
        echo $arr1[] = 2 * $item;
    }
}

//var_dump('<pre>', $arr1);

<?php
//11.237. Из элементов массива m сформировать массив n того же размера по правилу:
// если номер i элемента массива m нечетный, то , ni= i*mi в противном
//случае ni=mi/i
$m = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
$n = [];

for($i=0; $i < 10; $i++){
    if($m[$i] % 2 !== 0){
        $n[$i] = $i * $m[$i];
    }else{
        $n[$i] = $m[$i] / $i;
    }
}
var_dump('<pre>', $n);
//11.238. Из элементов массива p сформировать массив q того же размера по правилу:
// элементы с номером i от 3-го по 10-й находятся по формуле , qi=-pi
//все остальные — по формуле qi=pi*i
$p=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15];
$q=[];
for($i=0; $i<15; $i++) {
    if ($i >3 and $i< 10) {
        $q[$i]=-$p[$i];
    } else { $q[$i]=$p[$i]*$i;
    }
}
echo $q;
var_dump('<pre>', $q);
?>
<?php
//11.239. Из элементов массива a, заполненного целыми числами,
// сформировать массив b того же размера по правилу:
// четные элементы массива a удвоить, нечетные оставить без изменения.

$a=[1,2,3,4,5,6,7,8,9,10];
$b=[];
for($i=0; $i<10; $i++) {
    if($a[$i] % 2===0) {
        $b[$i]=$a[$i]*2;
    } else { $b[$i]= $a[$i];
    }
}
//echo $b;
var_dump('<pre>', $b);



//11.240. Из элементов массива m сформировать массив n того же размера по правилу:
// неотрицательные элементы массива m уменьшить в три раза, остальные — возвести в квадрат.
$m = [1, 2, 3, 4, 5, -1, -2, -3, -4, -5];
$n = [];
for ($i = 0; $i < 10; $i++) {
    if ($m[$i] > 0) {
        $n[$i] = $m[$i] / 3;
    } else {
        $n[$i] = $i * $i;
    }
}
var_dump('<pre>', $n);




//11.241. Дан массив. Переписать его второй, четвертый и т. д. элементы в другой
//массив такого же размера:
//а) расположив элементы на тех же местах, что и в исходном массиве;
//б) расположив элементы подряд с начала массива
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
$arr1 = [];
foreach ($arr as $key => $item) {

    if ($key % 2 === 0 {
        // $arr1[$key] = $item;
        $arr1[] = $item;
}
}

var_dump('<pre>', $arr1);


//11.243. Дан массив из 20 элементов. Сформировать два массива размером 10,
//включив в первый из них элементы заданного массива с четными индексами,
//а во второй — с нечетными.
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
$a = [];
$b = [];
foreach ($arr as $item) {
    if ($item % 2 === 0) {
        $a[$item] = $item;
    } else {
        $b[$item] = $item;
    }
}
var_dump('<pre>', $a, $b);
